; domain
(define (domain smoothie-making)
  (:requirements :strips :typing)
  (:types
    ingredient blender glass strawberry rum)

  (:predicates
    (clean ?bl - blender)
    (chilled ?g - glass)
    (in-blender ?i - ingredient ?bl - blender)
    (blended ?bl - blender)
    (contains-rum ?bl - blender)
    (smoothie-prepared ?bl - blender)
    (smoothie-in-glass ?g - glass)
    (garnished ?g - glass)
  )

  ;; Step 1: Place the yogurt, bananas, and sorbet in a blender.
  (:action place-ingredients
    :parameters (?y - ingredient ?b - ingredient ?s - ingredient ?bl - blender)
    :precondition (clean ?bl)
    :effect (and
      (in-blender ?y ?bl)
      (in-blender ?b ?bl)
      (in-blender ?s ?bl)
      (not (clean ?bl))
    )
  )

  ;; Step 2: Blend the mixture until it's smooth in texture.
  (:action blend-mixture
    :parameters (?bl - blender)
    :precondition (and
      (in-blender yogurt ?bl)
      (in-blender bananas ?bl)
      (in-blender sorbet ?bl)
      (not (blended ?bl))
    )
    :effect (blended ?bl)
  )

  ;; Step 3: Pour the rum in and quickly blend again.
  (:action add-rum-and-blend
    :parameters (?r - rum ?bl - blender)
    :precondition (and
      (blended ?bl)
      (not (contains-rum ?bl))
    )
    :effect (and
      (contains-rum ?bl)
      (smoothie-prepared ?bl)
    )
  )

  ;; Step 4: Pour the smoothie into chilled glasses.
  (:action pour-into-glass
    :parameters (?bl - blender ?g - glass)
    :precondition (and
      (smoothie-prepared ?bl)
      (chilled ?g)
    )
    :effect (smoothie-in-glass ?g)
  )

  ;; Step 5: Garnish each glass with a strawberry.
  (:action garnish-glass
    :parameters (?g - glass ?s - strawberry)
    :precondition (smoothie-in-glass ?g)
    :effect (garnished ?g)
  )
)

; problem
(define (problem make-smoothie)
  (:domain smoothie-making)
  (:objects
    yogurt bananas sorbet - ingredient
    rum - rum
    blender-1 - blender
    glass-1 - glass
    strawberry-1 - strawberry
  )

  (:init
    (clean blender-1)
    (chilled glass-1)
  )

  (:goal
    (garnished glass-1)
  )
)

; plan
1. (place-ingredients bananas sorbet yogurt blender-1)
   deleted: (clean blender-1)
   added: (in-blender bananas blender-1) (in-blender sorbet blender-1) (in-blender yogurt blender-1)
   goals met: 0 of 1
2. (blend-mixture blender-1)
   added: (blended blender-1)
   goals met: 0 of 1
3. (add-rum-and-blend rum blender-1)
   added: (contains-rum blender-1) (smoothie-prepared blender-1)
   goals met: 0 of 1
4. (pour-into-glass blender-1 glass-1)
   added: (smoothie-in-glass glass-1)
   goals met: 0 of 1
5. (garnish-glass glass-1 strawberry-1)
   added: (garnished glass-1)
   goals met: 1 of 1
